import React from 'react';
import IgraciTabela from './IgraciTabela';

const IgraciK = () => {
  const igraci = [
    {
      id: 1,
      ИМЕ: 'АЛЕКСАНДЕР МАЛКОЛМ БЕРНАРД',
      ПОЗИЦИЈА: 'ЦЕНТАР',
      ВИСИНА: '198',
      ГОДИНИ: '29',
      ДРЖАВА: 'us',
      СЛИКА: "/images/kosarka/Malcolm.png",
    },
    {
      id: 2,
      ИМЕ: 'АМАР ХОТ',
      ПОЗИЦИЈА: 'КРИЛО ЦЕНТАР',
      ВИСИНА: '203',
      ГОДИНИ: '20',
      ДРЖАВА: 'mk',
      СЛИКА: "/images/kosarka/Amar.png",
    },
    {
      id: 3,
      ИМЕ: 'АЛЕКСАНДАР КОСТОСКИ',
      ПОЗИЦИЈА: 'ОРГАНИЗАТОР НА ИГРАТА',
      ВИСИНА: '186',
      ГОДИНИ: '35',
      ДРЖАВА: 'mk',
      СЛИКА: "/images/kosarka/Aleksandar.png",
    },
    {
      id: 4,
      ИМЕ: 'АНДРЕЈ МАГДЕВСКИ',
      ПОЗИЦИЈА: 'ОРГАНИЗАТОР НА ИГРАТА',
      ВИСИНА: '192',
      ГОДИНИ: '27',
      ДРЖАВА: 'mk',
      СЛИКА: "/images/kosarka/AndrejM.jpg",
    },
    {
      id: 5,
      ИМЕ: 'АНДРЕЈ МАСЛИНКО',
      ПОЗИЦИЈА: 'КРИЛО/ЦЕНТАР',
      ВИСИНА: '208',
      ГОДИНИ: '26',
      ДРЖАВА: 'mk',
      СЛИКА: "/images/kosarka/Andrej.png",
    },
    {
      id: 6,
      ИМЕ: 'СТЕФАН МИЈОВИЧ',
      ПОЗИЦИЈА: 'КРИЛО',
      ВИСИНА: '194',
      ГОДИНИ: '28',
      ДРЖАВА: 'ba',
      СЛИКА: "/images/kosarka/Stefan.png",
    },
    {
      id: 7,
      ИМЕ: 'ЈУРЕ ПЛАНИНИЧ',
      ПОЗИЦИЈА: 'ЦЕНТАР',
      ВИСИНА: '206',
      ГОДИНИ: '23',
      ДРЖАВА: 'hr',
      СЛИКА: "/images/kosarka/Jure.png",
    },
    {
      id: 8,
      ИМЕ: 'БОРЈАН СТОЈАНОВСКИ',
      ПОЗИЦИЈА: 'КРИЛО',
      ВИСИНА: '190',
      ГОДИНИ: '23',
      ДРЖАВА: 'mk',
      СЛИКА: "/images/kosarka/Borjan.png",
    },
    {
      id: 9,
      ИМЕ: 'ЛУКА СТОЈАНОВСКИ',
      ПОЗИЦИЈА: 'КРИЛО',
      ВИСИНА: '189',
      ГОДИНИ: '23',
      ДРЖАВА: 'mk',
      СЛИКА: "/images/kosarka/Luka.png",
    },
    {
      id: 10,
      ИМЕ: 'ДИМИТАР СЕРДАРОВ',
      ПОЗИЦИЈА: 'КРИЛО',
      ВИСИНА: '192',
      ГОДИНИ: '18',
      ДРЖАВА: 'mk',
      СЛИКА: "/images/kosarka/Dimitar.png",
    },
    {
      id: 11,
      ИМЕ: 'ДАРКО НАЈДОВСКИ',
      ПОЗИЦИЈА: 'ОРГАНИЗАТОР НА ИГРА',
      ВИСИНА: '175',
      ГОДИНИ: '29',
      ДРЖАВА: 'mk',
      СЛИКА: "/images/kosarka/Darko.png",
    },
    {
      id: 12,
      ИМЕ: 'ИВАН САПУНЏЕВ',
      ПОЗИЦИЈА: 'КРИЛО/ЦЕНТАР',
      ВИСИНА: '191',
      ГОДИНИ: '28',
      ДРЖАВА: 'mk',
      СЛИКА: "/images/kosarka/Ivan.png",
    },
    {
      id: 13,
      ИМЕ: 'ДАРКО РАДУЛОВИЌ',
      ПОЗИЦИЈА: 'ТРЕНЕР',
      ВИСИНА: '192',
      ГОДИНИ: '43',
      ДРЖАВА: 'mk',
      СЛИКА: "/images/kosarka/DarkoR.jpg",
    },
  ];

  return (
      <IgraciTabela igraci={igraci} />
  );
};

export default IgraciK;
