import React from "react"
import {  Segment, Header, Image, } from "semantic-ui-react"


const Istorija  = () => (
    <Segment.Group>
        <Segment inverted secondary color='green'>
        <Image
            fluid
            label={{
                attached: 'top left',
                size: 'big',
                color: 'green',
                content: '2017 ГОДИНА ПЕЛИСТЕР ПОБЕДНИК НА КУПОТ НА МАКЕДОНИЈА',
                ribbon: 'true'   
            }}
            src="/images/fudbal/Kup.jpg" centered 
         />
        </Segment>
            <Header as='h1'  textAlign='center'  >
                ИСТОРИЈА НА ФК ПЕЛИСТЕР
            </Header>
        <Segment size='huge' textAlign='center' inverted color='blue'
            style={{
                fontFamily: 'sans-serif',
                fontSize: '25px'
                }}
            >
            <p>
            ФК Пелистер - фудбалски клуб од Битола, Македонија, кој моментално настапува во Втора македонска фудбалска лига.
            Клубот е формиран по ослободувањето во 1945 година, иако негови претходници во Битола егзистираат од 1924 година. 
            Клупските бои на Пелистер се зелената и белата. Клубот игра на градскиот стадион Тумбе кафе.
            </p>
            <p>
            ФК Пелистер беше формиран во 1924 година, најпрво под името „Омладина“,
            кое подоцна било сменето во „Пелистер“, а подоцна во „СК Битола“. Клубот
            повторно се појавил под старото име „Пелистер“ по ослободувањето во 1945
            година, а веќе во 1946 година станал првак во битолскиот фискултурен округ.
            Истата година, клубот се споил со "ФК Работник", но го задржал името Пелистер.
            Некои од попознатите играчи од тоа време биле: Ѓеоргиевски, Димитровски,
            Мицевски, Петровски, Наумовски, Лазаревски, Шекерџиевски, Аврамовски,
            Несторов и Ефтимовски.
            </p>
            <p>
            Пелистер за првпат во својата историја влегол во втората југословенска лига
            во сезоната 1974/1975. Пелистер не успеал да се задржи подолго време во
            втората лига, но подоцна се вратил во лигата во 1982 година, кога на чело
            на клубот биле Митко Бутлевски и тренерот Иван Чабриновиќ. Пред распаѓањето
            на СФР Југославија, Пелистер настапувал и во Првата сојузна лига.
            </p>
            <p>
            По осамостојувањето на Република Македонија, Пелистер континуирано се
            натпреваруваше во првата македонска фудбалска лига сѐ до сезоната 2002/2003,
            кога клубот испаѓа од највисокото натпреварување во Македонија.
            Пелистер нема освоено шампионска титула во првенството на Македонија, но
            двапати е освојувач на Купот на Македонија во 2001 и во 2017 година.
            </p>
        </Segment>
    </Segment.Group>
)

export default Istorija
        