import React from 'react'
import { Header, List, Icon, Divider, Label, Segment } from 'semantic-ui-react'


export default function Istorija() {
    const size1 = 'huge'
    const size2 = 'large'
    return (
        <Segment.Group>
            <Segment inverted secondary color='green'>
                <Header as='h1' textAlign='center' style={{ color: 'white', fontFamily: 'Arial, sans-serif' }}>
                    ИСТОРИЈА
                    <Icon name='history' />
                </Header>
                <List bulleted divided size={size1} style={{ color: 'white', fontFamily: 'Arial, sans-serif' }}>
                    <Header style={{ color: 'yellow' }}>УСПЕСИ</Header>
                    <List.Item>
                        <List.Header>НАЦИОНАЛНИ <Icon inverted color='olive' name="trophy " size='big' /></List.Header>
                        <List.List>
                        <List.Item size={size2}>Супер Лига :  </List.Item>
                        Првак : 1992/93, 1993/94, 1995/96, 1997/98, 1999/00, 2004/05, 2022/2023.
                        <List.Item>Куп на Македонија :  </List.Item>
                        Првак : 1990, 1994, 1996, 1998, 1999, 2005.
                        <List.Item>Македонска републичка ракометна лига :  </List.Item>
                        Првак :1968, 1969, 1970, 1971, 1979, 1981.
                        <List.Item>Суперкуп на Македонија :  </List.Item>
                        Првак :2021, 2022.
                    </List.List>
                    </List.Item>
                    <List.Item>
                        <List.Header>МЕЃУНАРОДНИ <Icon inverted color='olive' name="trophy " size='big' /></List.Header>
                        <List.List size={size2}>
                                <List.Item>ЕХФ Лига на шампиони :  </List.Item>
                                1993-94 - Прелиминарна рунда <br />
                                1994-95 - Прелиминарна рунда <br />
                                2005-06 - Групна фаза <br />
                                2019–20 – Групна фаза <br />
                                2023–24 – Групна фаза <br />
                                <List.Item>ЕХФ Европска лига :  </List.Item>
                                2018-19 - Групна фаза <br />
                                2021-22 - Нокаут фаза <br />
                                2022-23 - Групна фаза <br />
                                <List.Item>ЕХФ куп на победници :  </List.Item>
                                Полуфинале : 1995/96.
                                <List.Item>ЕХФ Челенџ куп :  </List.Item>
                                Финалист : 2001/02.
                                <List.Item>ЕХФ куп :  </List.Item>
                                Четвртфинале : 1988/89.
                                <List.Item>Меѓународен ракометен турнир во Добој :  </List.Item>
                                Освојувач : 1996, 1997.
                            </List.List>
                    </List.Item>
                </List>
            </Segment>
            <Divider />
            <Segment textAlign='center'>
                <Label color='green'>
                    <Header size='huge' style={{ color: 'white', fontFamily: 'Arial, sans-serif' }}>
                        Почетоците и историјата на Пелистер
                    </Header>
                </Label>
            </Segment>
            <Segment size='massive' textAlign='center' inverted secondary color='green'
                style={{
                    fontFamily: 'Arial, sans-serif',
                    fontSize: '20px',
                    color: 'white'
                }}>
                <p>
                                РК Еурофарм Пелистер е ракометен клуб од Битола, Северна Македонија.
                                Моментално се натпреваруваат во Македонската ракометна Супер лига и ЕХФ Лигата на шампионите.
                                Оригиналниот тим беше првиот ракометен клуб во Македонија,формирана во 1946 година под името Пелагонија.
                                Подоцна во 1955 година го смени името во Пелистер.
                                60-тите беа многу успешни, освојувајќи 4 првенства почнувајќи од 1960 година до последното во 1969 година.
                                Клубот на крајот освои уште три титули во 70-тите. Во 80-тите, сезоната 1981 беше последната победничка сезона,
                                освојувајќи ја својата 8-ма титула во македонското првенство. Од сезоната 1983-84 Пелистер почна редовно да учествува во
                                Ракометно првенство на Југославија. Завршија на третото место во 1985 година и беа второпласирани во сезоните на ред
                                (1986–87 и 1987–88) зад доминантниот клуб Металопластика Шабац. Околу тоа време слоганот
                                „Кој не играл во Битола, не знае како изгледа вистинската поддршка“ стекна популарност,
                                изречена од луѓе како Владо Шола, Лино Червар и Златан Сарачевиќ.
                                Пелистер стана првиот македонски клуб кој настапува во Европа.
                                Во 1986 година тие го победија АС Филипос Веријасанд во 1. коло.
                                но тие на крајот загубија во 1/8 финалето од Атлетико Мадрид БМ победувајќи со 24:19 дома и 10:19 на гости (34:38).
                                агрегат. Во сезоната 1988/1989 стигнаа до четвртфиналето на Купот на ЕХФ, елиминирајќи го СПЕ Строволос Никозија,
                                РК Баник и конечно пораз од германскиот клуб АСК Ворвартс. Првиот натпревар во Битола го добија со шест гола разлика.
                                но реваншот во Берлин резултираше со негатива од седум поени 22:16 и 13:22 (35:38).
                                Кога во 1992 година се формираше Македонската ракометна супер лига, Пелистер стана најуспешен клуб во државата.
                                освојувајќи пет титули во лигата и пет Купа таа деценија. Во 1996 година, тие се пласираа во полуфиналето на Куповите на ЕХФ.
                                Купот каде што загубија со вкупна разлика со еден гол од евентуалниот шампион ТБВ Лемго.
                                Рекордно, 7.000 гледачи присуствуваа на реваншот во Битола. Уште еден доказ за доминацијата Пелистер
                                во тоа време беа седумте играчи во составот на Македонија на Светското првенство во ракомет за мажи во Египет во 1999 година
                                играа за клубот.   
                                Најуспешната европска серија на клубот беше направена за време на сезоната 2001/02 кога играа во Челинџ купот на ЕХФ.
                                Прво, тие започнаа победувајќи го Зилант Казан во 3. коло и се пласираа во 4. коло, каде што продолжија со поразот над
                                Пари Сен Жермен. Во четвртфиналето тие го поминаа ГАС Кукуш со 52-51, поставувајќи полуфинален меч со Фредериксберг ИФ.
                                Пелистер драматично ќе го освои тоа изедначено во Битола, кога Наумче Мојсовски постигна гол во последните секунди од натпреварот
                                за да го израмни вкупниот резултат, поминувајќи во пенал рулетот со конечни 61-60.
                                Во финалето, Пелистер загуби од Скјерн Хандболд, но и во тој натпревар сепак на крајот го добија 
                                домашниот натпревар со 7 гола разлика.
                                Докажувајќи уште еднаш дека не беше лесна задача за ниту една гостинска екипа да победи во Битола.
                                Во 2005 година, Трифун Костовски со Кометал стана спонзор на клубот враќајќи ги славните денови, 
                                освојувајќи уште една двојна круна и освојувајќи ја шестата титула во домашното првенство,
                                што беше рекорд во тоа време. Сепак, успехот беше краткотраен бидејќи Кометал си замина по таа сезона.
                                Потоа, Пелистер беше нарушен со финансиски проблеми и се мачеше да го постигне истото ниво на успех.
                                На 29 ноември 2019 година, беше потпишана заедничка сопственост на сопствениците на РК Еурофарм Работник 
                                (кој е формиран во 2011 година и е во сопственост на Еурофарм) и РК Пелистер (сопственост на општина Битола).
                                Според платформата, РК Еурофарм Работник би го променил името во Еурофарм Пелистер, а оригиналниот РК Пелистер би го променил
                                името во Еурофарм Пелистер 2. Еурофарм Пелистер ќе биде водечки клуб со високи европски амбиции, додека Еурофарм Пелистер 2 ќе
                                биде развојен клуб исполнет со млади ракометари од Битола и од цела Македонија. Комбинацијата на силен спонзор и спортски 
                                бренд познат низ поранешна Југославија доби конечна форма преку договор со градската администрација во 2020 година. 
                                Еурофарм Пелистер веќе ја надмина домашната рамка, играше во Лигата на шампионите на ЕХФ и ги постави контурите на еден тим
                                што би можело да ги врати трофеите во арената „Боро Чурлевски“. Ова беше официјално остварено во мај 2023 година, 
                                кога за прв пат по 18 години беа крунисани за шампиони на Македонија во Суперлигата.  
                 </p>
            </Segment>
        </Segment.Group>
    );
}