import React from 'react';
import { Segment } from 'semantic-ui-react';

const Istorija = () => (
  <Segment padded textAlign='center' inverted tertiary color='teal'
    style={{
        fontFamily: 'sans-serif',
        fontSize: '25px'
        }}
    >
    <p>
      Чкембари се една од најстарите и најпознатите навивачки групи во Македонија, а нејзината историја започнала во 1985 година.
      Од почетокот, оваа група ги поддржува сите спортски клубови од Битола кои го носат името Пелистер.
      Навивачите на Чкембари се познати по своето страстно и предано навивање, особено на фудбалските натпревари.
    </p>
    <p>
      Групата има богата историја на поддршка кон ФК Пелистер, а најголемиот успех на клубот, освојувањето на купот во 2001 година,
      ја забележаа како еден од најголемите моменти во историјата на Чкембари.
      Тие дораснале со клубот и го следат во неговите настапи, вклучително и во меѓународните такмичења како купот на УЕФА.
    </p>
     <p>
      Навивачката група Чкембари е разделена на неколку подгрупи, каде секоја има свои транспаренти и знамиња.
      Тие се обично формирани од навивачи кои доаѓаат од иста населба. Истакнати подгрупи вклучуваат Chaos, Extremo Karpos, Green Front, Ultras Bair и Boys from Centar (BFC).
      Секоја од овие подгрупи допринесува со својата енергија и стил на навивање, што прави Чкембари разновидна и жива навивачка заедница.
    </p>
    <p>
      Соперништвото помеѓу Чкембари и Комити (навивачи на ФК Вардар) е едно од најзначајните во македонскиот фудбал.
      Ова соперништво произлегло во 1989 година и честопати резултирало со напетост и инциденти на фудбалските натпревари помеѓу ФК Пелистер и ФК Вардар.
      Навивачите на Чкембари и Комити важат за неколку од најстрастните и предани навивачи во Македонија.
    </p>
    <p>
      Важно е да се кажи дека, иако постои силно соперништво помеѓу Чкембари и Комити на клупската равнина,
      кога станува збор за државната репрезентација на Македонија, навивачите од двете групи се обединуваат и заедно ја поддржуваат репрезентацијата.
      Ова е добар пример за спортски патриотизам и обединување на навивачите во име на националниот тим.
    </p>
  </Segment>
);

export default Istorija;